#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'

"""
29.
 Написать функцию,
  которая получает в качестве аргумента число от 1 до 99, а возвращает его строковое представление.
Пример: 56 -> "пятьдесят шесть"

"""
#n = 56 #пять десят шесть
n = 5 #пять
#n = 20 #два дцать
#n = 30 #три дцать
#n = 81 #восемь десят один
#n = 91 #девяносто один

def funcz(n):
    """
    функция получает в качестве аргумента число от 1 до 99, а возвращает его строковое представление.
    Пример: 56 -> "пятьдесят шесть"
    :param n:
    :return:
    """
    n2 = n
    print("ввели число: ", n)
    n2 = str(n2)
    n2 = list(n2)
    ln = len(n2)
    if ln == 2:
        n21 = int(n2[0])
        n22 = int(n2[1])
    #    print("n21 = ", n21, "n22 = ", n22)
    #print(n2, ln)
    d1 = {10 :"десять", 20 :"двадцать", 30 :"тридцать", 40:"сорокет", 50:"полтинник", 60:"шестьдесят", 70:"семьдесят", 80:"восемьдесят", 90:"девяносто"}
    d2 = {0:"дцать", 1:"один", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять"}
    if n in d1:
    #    print("URA!")
        res = d1[n]
    elif ln == 1:
        res = d2[n]
    elif ln == 2 and n21 < 9:
        res = d2[n21]+"десят "+d2[n22]
    elif ln == 2 and n21 == 9:
        res = "девяносто "+d2[n22]
    #print(d1, d2)
    return res
print(funcz(n))