#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
35. Написать функцию, получающую в качестве аргумента целое число x,
 и возвращающую строковое представление x в двоичной системе счисления.
"""
x = 56
def funcz(x):
    return "{0:b}".format(x)
print(funcz(x))#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
35. Написать функцию, получающую в качестве аргумента целое число x,
 и возвращающую строковое представление x в двоичной системе счисления.
"""
x = 56
def funcz(x):
    return "{0:b}".format(x)
print(funcz(x))