#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'

"""
37.
Написать функцию, получающую в качестве аргумента список чисел с плавующей точкой и вовращающую
среднее арифметическое этого список

l1 = [3.0, 5.5, 7.0, 9,5]

"""

l1 = [3.0, 5.5, 7.0, 9.5]


def funcz(l1):
    return sum(l1) / len(l1)
print(funcz(l1))

#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'

"""
37.
Написать функцию, получающую в качестве аргумента список чисел с плавующей точкой и вовращающую
среднее арифметическое этого список

l1 = [3.0, 5.5, 7.0, 9,5]

"""

l1 = [3.0, 5.5, 7.0, 9.5]


def funcz(l1):
    return sum(l1) / len(l1)
print(funcz(l1))

