#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
38.
Написать функцию, получающую в качестве аргумента список чисел с плавующей точкой и целое число n вовращающую
 список состоящий из скользящих средних шириной n

l1 = [3.0, 5.0, 7.0, 9.0, 2.0, 11.0 ]
n = 2
ответ:
[4.0, 6.0, 8.0, 5.5, 6.5]
"""
l1 = [3.0, 5.0, 7.0, 9.0, 2.0, 11.0 ]
#l1 = [3.0, 5.0, 7.0]

n = 2
def funcz(l1, n):
    print(l1)
    l3 = []
    for i in range(len(l1)-n+1):
    #    if (len(l1) - i) >= n:
            z = l1[i:n+i]
            print("n+i = ", n+i, "| z = ", z, "| i = ", i, "| sum = ", sum(z) / n)
            l3.append(sum(z) / n)
    return l3
print(funcz(l1, n))#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
38.
Написать функцию, получающую в качестве аргумента список чисел с плавующей точкой и целое число n вовращающую
 список состоящий из скользящих средних шириной n

l1 = [3.0, 5.0, 7.0, 9.0, 2.0, 11.0 ]
n = 2
ответ:
[4.0, 6.0, 8.0, 5.5, 6.5]
"""
l1 = [3.0, 5.0, 7.0, 9.0, 2.0, 11.0 ]
#l1 = [3.0, 5.0, 7.0]

n = 2
def funcz(l1, n):
    print(l1)
    l3 = []
    for i in range(len(l1)-n+1):
    #    if (len(l1) - i) >= n:
            z = l1[i:n+i]
            print("n+i = ", n+i, "| z = ", z, "| i = ", i, "| sum = ", sum(z) / n)
            l3.append(sum(z) / n)
    return l3
print(funcz(l1, n))