#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
41. Написать программу,
 считывающую текстовой файл и выводящую 20 самых часто встречающихся в нем слов.
  Слово - это последовательность символов, не содержащая разделителей.
   Разделители - это символы в данной строке: " .,:;-?!\n".
   Имя файла передается в качестве парамтра командной строки.

"""
#!/usr/bin/env python3
# -*- coding: utf-8 -*-
__author__ = 'petro-ew'
"""
41. Написать программу,
 считывающую текстовой файл и выводящую 20 самых часто встречающихся в нем слов.
  Слово - это последовательность символов, не содержащая разделителей.
   Разделители - это символы в данной строке: " .,:;-?!\n".
   Имя файла передается в качестве парамтра командной строки.

"""
